-- Должности
INSERT INTO public.employee_post (id, post_name, post_role)
VALUES ('ef96d80e-7676-41f2-8aef-44b3070b7b4c', 'Составитель расписаний', 'ROLE_SCHEDULE_MAKER'),
       ('959d2543-e750-44d4-bb3e-ed6bc1de1d63', 'Администратор', 'ROLE_ADMIN'),
       ('76b10e67-4edb-4cec-a665-b7ad718699e5', 'Преподаватель', 'ROLE_TEACHER');

-- Админ
INSERT INTO public._user (id, account_status, email, name, password, patronymic, refresh_token, role, sex, surname)
VALUES ('1577ab67-59ad-4f4a-960e-71b718f6e7e0', 'ACTIVATE', 'admin@gmail.com', 'Иван',
        '$2a$10$LT8ARAzac6s58zqpUFf3uecfb9Oj5b7FfStnRRwi.fJD8EZfkppDy', 'Иванович', null, 'ROLE_EMPLOYEE', 'MALE',
        'Иванов');
INSERT INTO public.employee_details (id, contract_number, teacher_id, user_id)
VALUES ('67704db8-afbd-4060-8067-730a232724e4', 'admin', null, '1577ab67-59ad-4f4a-960e-71b718f6e7e0');
INSERT INTO public.employee_posts (employee_id, posts_id)
VALUES ('67704db8-afbd-4060-8067-730a232724e4', '959d2543-e750-44d4-bb3e-ed6bc1de1d63');

-- Аудитории
INSERT INTO public.classroom (id, number)
VALUES ('ce4cc449-48ae-4005-b7e6-1c67dba07d21', '204 (2) Компьютерный класс'),
       ('7e58c0d2-7738-4f78-a1bb-9f8c7d7ce0f4', '206 (2) Компьютерный класс'),
       ('3da66ea5-67f7-46a5-9883-80065ea949f0', '208 (2) Компьютерный класс'),
       ('fb0b62d1-dc8e-443d-9831-114bc9aa9321', '210 (2) Компьютерный класс'),
       ('3784d5cd-ba1b-4006-84a0-baf3211a1c94', '212а (2) Компьютерный класс'),
       ('65942f0c-413f-4baf-9b75-d24fbd675bff', '212б (2) Учебная аудитория'),
       ('dd13e960-a691-4a9f-91ee-7c7841c7f680', '214 (2) Учебная аудитория'),
       ('55bbe6f4-6903-4771-a21c-6458afc71aa4', '216 (2) Учебная аудитория'),
       ('92f46ff9-0854-4835-b512-4e39e3f729ef', '217 (2) Компьютерный класс'),
       ('c453d1ab-be54-48d6-a974-11320e03d6c2', '218 (2) Учебная аудитория'),
       ('ea188e76-4f22-4ef8-b271-0c317159434c', '220 (2) Учебная аудитория'),
       ('f8430b97-13ba-4d77-a812-3175109ea684', '224 (2) Учебная аудитория'),
       ('f0671104-0a77-4b93-a2ef-34743d416bb5', '226 (2) Учебная аудитория'),
       ('caa940bd-57bd-48ac-88b4-c66b156655c6', '227 (2) Учебная аудитория'),
       ('a7dc5cc7-8dad-4d8e-89d3-02984d6686e2', '228 (2) Учебная аудитория');

-- Предметы
INSERT INTO public.subject (id, name)
VALUES ('4b411cd2-73d2-4a20-a90f-2e4c01f39174', 'Иностранный язык'),
       ('9e874731-12c4-4551-b690-4d7247e67d16', 'Разработка и анализ требований'),
       ('f2d96517-655a-4820-83ea-d218bc4e55cc', 'Основы командной разработки'),
       ('4af34f1b-f968-494f-a336-c3677ae0ff24', 'Основы машинного обучения'),
       ('9f9c3076-965a-49e2-995e-dde013bc0509', 'Тестирование программного обеспечения'),
       ('c2910c28-d5a5-4919-abdb-4da592031e82', 'Элективные дисциплины по физической культуре и спорту'),
       ('271e983b-d3e4-4900-8ae9-e2e45d56b0e3', 'Введение в проектную работу'),
       ('aaa3618b-5c23-46c6-868e-cf50b63c30df', 'Основы backend-разработки'),
       ('76728bf5-5c31-472a-a0db-966064498eca', 'Проектная разработка'),
       ('1787780c-a34d-4c80-b276-90892be2d290', 'Основы Web разработки (Frontend)'),
       ('a4b0c436-7618-493d-9200-82ea8b26760c', '1С разработка'),
       ('1b14f957-02bb-4213-ab04-fa55235800e0', 'Разработка серверных приложений'),
       ('78ed80bb-b886-4282-bd80-fdd3e71d58ba', 'Системный анализ'),
       ('02c86a34-fe11-4207-a5d4-4f31d572dfa2', 'Web-разработка приложений'),
       ('31618046-f0d3-497c-a9d6-530d204045dd', 'Разработка мобильных приложений'),
       ('10651ccf-d5fc-47e6-a4b7-1039dd715d0f', 'Машинное обучение');

-- Таймслоты
INSERT INTO public.timeslot (id, begin_time, end_time, sequence_number)
VALUES ('8c4ec190-23a6-4bc8-bbb3-295a083a4cfb', '8:45', '10:20', 1),
       ('6aa15600-1948-40a3-b935-89cce1bf530a', '10:35', '12:10', 2),
       ('08b4cf19-73ba-4d55-a3f9-28617defdc20', '12:25', '14:00', 3),
       ('cdefddb4-fed5-4444-b67a-71c6568fb1cc', '14:45', '16:20', 4),
       ('50401b9a-91c3-4d73-9fdb-5e092623839b', '16:35', '18:10', 5),
       ('8beab6ad-4244-4ec7-8d90-3ac2822a8e47', '18:25', '20:00', 6),
       ('5d1064f6-7f92-4525-b21a-67b1c0a7307a', '20:15', '21:50', 7);

-- Преподаватели
INSERT INTO public.teacher (id, name, patronymic, surname)
VALUES ('16a4274c-f573-4475-8a00-7383e883544c', 'Иван', 'Иванович', 'Иванов'),
       ('96161575-bdc2-41d8-b0d6-1bacd6ddbe92', 'Станислав', 'Павлович', 'Романов'),
       ('0a52f102-fc30-4802-a86b-1d3ab5a5777f', 'Богдан', 'Натанович', 'Якушев'),
       ('2550c9b2-f29d-4f65-b68c-0678c55df836', 'Вилли', 'Максимович', 'Савин'),
       ('ba7597b4-35f3-4cee-8e90-78832526661e', 'Роман', 'Витальевич', 'Громов'),
       ('4bd576af-21ef-4948-a0c0-531d284da1e9', 'Мартин', 'Евсеевич', 'Ермаков'),
       ('6709959c-f8df-49c1-92af-dff2da90f6de', 'Аркадий', 'Степанович', 'Сергеев'),
       ('d72f3b85-982d-4252-a7d7-5827aa63fe5b', 'Мартын', 'Тихонович', 'Тихонов'),
       ('e08f78e1-535e-449c-bbb6-64c560f66436', 'Алина', 'Богуславовна', 'Фокина'),
       ('01cb8366-d676-4332-8f79-b13ce44f3c45', 'Нина', 'Тихоновна', 'Колобова'),
       ('4eea9c97-e363-486b-b630-9fe48656ecb5', 'Ульяна', 'Васильевна', 'Казакова'),
       ('1098ff65-6da5-4d76-8641-a89ca6609a8d', 'Наталья', 'Егоровна', 'Титова'),
       ('1b4c2f98-b006-46ce-acae-8a39070bbcf3', 'Бронислава', 'Юрьевна', 'Силина'),
       ('704e3121-2246-4263-95d1-497b887acec4', 'Ксения', 'Феликсовна', 'Сазонова'),
       ('399bc6d4-493f-4a32-af99-212fde8dab59', 'Санта', 'Иосифовна', 'Емельянова');

